app/controllers/charted_accountants_controller.rb

  def index
    @charted_accountants = ChartedAccountant.all
---
SELECT "charted_accountants".* FROM "charted_accountants"

  def create
    @charted_accountant = ChartedAccountant.new(charted_accountant_params)

    respond_to do |format|
      if @charted_accountant.save
---
INSERT INTO "charted_accountants" ("name", "phn_no", "address", "email", "ca_no", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

    def set_charted_accountant
      @charted_accountant = ChartedAccountant.find(params[:id])
---
SELECT  "charted_accountants".* FROM "charted_accountants" WHERE "charted_accountants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]