app/controllers/general_settings_controller.rb

	def update
    @general_setting = GeneralSetting.shod(params[:id])

    if @general_setting.update(general_setting_params)
---
UPDATE "general_settings" SET "first_name" = $1, "last_name" = $2, "contact_no" = $3, "email" = $4, "gst_no" = $5, "pan" = $6, "name_of_service" = $7, "service_acc_code" = $8, "rate_of_tax" = $9, "updated_at" = $10 WHERE "general_settings"."id" = $11