app/controllers/parties_controller.rb

SELECT "parties".* FROM "parties"
---
  def index
    if current_user.role == "ChartedAccountant"
     @parties = current_user.charted_accountant.parties
   elsif current_user.role == "SuperAdmin"
     @parties = Party.all

INSERT INTO "parties" ("party_name", "party_gstin_no", "party_arn_no", "party_address", "place_of_supply", "commodity_name", "tarrif_no", "hsn_no", "rate_of_tax", "name_service", "service_acc_code", "party_pan_no", "state_name", "state_code", "ca_name", "ca_contact", "created_at", "updated_at", "email", "party_no", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24) RETURNING "id"
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "role", "party_id", "first_name", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @party = Party.new(party_params)
      if current_user.role == 'ChartedAccountant'
        @party.update!(:charted_accountant_id => current_user.charted_accountant.id)
        User.create!(first_name: @party.party_name, username: @party.email, party_id: @party.id, password: @party.party_no, role: 'Party',email: @party.email)

SELECT  "parties".* FROM "parties" WHERE "parties"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_party
      @party = Party.find(params[:id])